Tekla.Structures.Model.Assembly
The Assembly class defines a single manufacturing unit: objects that are bolted or welded together in the workshop.
An assembly has a main part and secondary assemblables attached to it. The number of secondaries is limited to 2048.
Hierarchical assemblies can also have subassemblies attached to them and they can have a parent assembly instance.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
Beam beam1 = new Beam(new Point(0,0,0), new Point(1000,0,0));
Beam beam2 = new Beam(new Point(0,0,0), new Point(0,0,1000));
beam1.Profile.ProfileString = "380*380";
beam1.Material.MaterialString = "K40-1";
beam2.Profile.ProfileString = "380*380";
beam2.Material.MaterialString = "K40-1";
beam1.Insert();
beam2.Insert();
Assembly assembly = beam1.GetAssembly();
assembly.Add(beam2);
if(!assembly.Modify())
Console.WriteLine("Assembly Modify Failed!");
}
}

Tekla.Structures.Model.Assembly.GetMainPart
Selects and returns the main part of the assembly or null if none.
Returns: The main part of the assembly or null.

Tekla.Structures.Model.Assembly.SetMainPart(Tekla.Structures.Model.Part)
Sets the main part of the assembly.
Part: The part to set as the main part of the assembly.
Returns: True if the part was valid.

Tekla.Structures.Model.Assembly.Insert
At the moment assemblies cannot be inserted.
Returns: False.